Tekla.Structures.Analysis.AnalysisModelLoad
The AnalysisModelLoad class contains information related to the model loads that are included in the analysis model.
The identifier is the identifier of the Tekla.Structures.Model object.

Tekla.Structures.Analysis.AnalysisModelLoad.Select
Selects an analysis node.
The ID has to be set.